<h2>Заметки о Git'е</h2>
<h6>18.12.2021</h6>
<p>
    <pre>gitk</pre>
    это команда для запуска программы для контроля версий, работающая на основе системы Git.
</p>
<p>
    Команда 
    <pre>git init</pre> 
    позволяет создать пустой репозиторий в текущей папке.
</p> 
<p>
    Команда 
    <pre>git add</pre>
    позволяет мне добавить файл в индекс.
</p> 
<p>
    Команда 
    <pre>git commit -m ""</pre>
    позволяет зафиксировать измененную версию в GitK
</p>
<p>
    Команда 
    <pre>git status</pre>
    позволяет проверить ветку на предмет незафиксированных изменений версий
</p>
<p>
    Команда
    <pre>git push</pre>
    позволяет отправить измененную версию на сервер
</p>
<hr>
